## Semana 04

- Descripción: Curso de Fundamentos de Python
- Semana 4: Manipulación de datos
- Autor: Jaime Gomez
- Fecha: 11/10/2025
- Versión:1

In [32]:
# open() es una funcion para abrir archivos
#  modo r : lectura
#  modo a : agregación

# Abrir archivo
mi_archivo = open("archivo1.txt",'r')

print(type(mi_archivo))
print(mi_archivo.name)

# TO DO
data = mi_archivo.read()
print(data)
print(mi_archivo.closed)

# Cerrar archivo
mi_archivo.close()
print(mi_archivo.closed)

<class '_io.TextIOWrapper'>
archivo1.txt
Linea 1
Linea 2
Linea 3
Linea 4
Linea 5
Linea 6
Linea 7
False
True

In [33]:
# open() es una funcion para abrir archivos
#  modo r : lectura
#  modo a : agregación

# Abrir archivo
with open("archivo1.txt",'r') as mi_archivo:
    contenido = mi_archivo.read()
    print(contenido)
    
print(mi_archivo.closed)

Linea 1
Linea 2
Linea 3
Linea 4
Linea 5
Linea 6
Linea 7
True

In [34]:
# open() es una funcion para abrir archivos
#  modo r : lectura
#  modo a : agregación

# Abrir archivo
with open("archivo1.txt",'r') as mi_archivo:
    contenido = mi_archivo.read(2)
    print(contenido)
    contenido = mi_archivo.read(2)
    print(contenido)

Li
ne

### Leer lineas de un archivo

In [35]:
with open("archivo1.txt",'r') as mi_archivo:
    contenido = mi_archivo.readline()
    print(contenido)
    contenido = mi_archivo.readline()
    print(contenido)

Linea 1

Linea 2

In [36]:
with open("archivo1.txt",'r') as mi_archivo:
    for una_linea in mi_archivo:
       print(una_linea)

Linea 1

Linea 2

Linea 3

Linea 4

Linea 5

Linea 6

Linea 7

In [37]:
with open("archivo1.txt",'r') as mi_archivo:
    contenido = mi_archivo.readlines()
    print(contenido)

for linea in contenido:
    print(linea)

['Linea 1\n', 'Linea 2\n', 'Linea 3\n', 'Linea 4\n', 'Linea 5\n', 'Linea 6\n', 'Linea 7']
Linea 1

Linea 2

Linea 3

Linea 4

Linea 5

Linea 6

Linea 7

### Ejercicio 1

Dado el archivo personas.txt, calcular lo siguiente

- Juan:Pastor:25:Pyhton
- Jose:Gomez:18:Pyhton
- Maribel:Alegria:22:Java
- Ana:Garcia:23:C#
- Pedro:Flores:20:Java
- Elizabeth:Alvarado:26:Pyhton
- Jaime:Alvarez:22:Pyhton
- Noemi:Palomino:26:Php
- Pedro:Davila:30:Php

Debe calcular

- Los lenguajes de programación favoritos
- Los apellidos de todos los participantes
- Los nombre de las personas mayores de 22 años

In [38]:
# Lectura de datos
nombre_archivo = "personas.txt"

contenido = []
with open(nombre_archivo,'r') as mi_archivo:
    contenido = mi_archivo.readlines()
    
# Tratamiento de los datos de los programas
progs = []
for una_linea in contenido:
    #print(una_linea)
    dato_persona = una_linea.split(':')
    progs.append(dato_persona[3])
    #print(dato_persona[3])
    
# Salida de los datos
print(set(progs))

{'Java\n', 'C#\n', 'Php\n', 'Pyhton\n'}

### Módulo y paquetes

In [39]:
def suma(a, b):
   return a+b

s = suma(4,5)

print(s)

9

In [40]:
from mate import resta, mul

r = resta(4,5)
print(r)

m = mul(4,5)
print(m)

-1
20

In [41]:
import mate as ma

r = ma.resta(4,5)
print(r)

m = ma.mul(4,5)
print(m)

d = ma.div(4,5)
print(d)

-1
20
0.8

In [42]:
def imprimir(mensaje, relleno="-" , nro_veces=2):
    for i in range(nro_veces):
        print(mensaje + relleno)

imprimir("hola", nro_veces=5)

hola-
hola-
hola-
hola-
hola-

### Pandas

In [43]:
import pandas as pd

personas = [
                ['Maria',18],
                ['Juan',25],
                ['Silvia',20],
                ['Albert',30]
            ]

df = pd.DataFrame(personas,columns=['nombre','edad'])

print(df)

   nombre  edad
0   Maria    18
1    Juan    25
2  Silvia    20
3  Albert    30

In [44]:
print(df['nombre'])

0     Maria
1      Juan
2    Silvia
3    Albert
Name: nombre, dtype: object

In [45]:
print(df['edad'])

0    18
1    25
2    20
3    30
Name: edad, dtype: int64

In [46]:
print(df[df['edad']>20])

   nombre  edad
1    Juan    25
3  Albert    30

In [47]:
import pandas as pd

personas = {
     "nombre": ['Maria','Juan','Silvia','Albert'],
     "edad":   [18,25,20,30]
}

df = pd.DataFrame(personas)

print(df)

   nombre  edad
0   Maria    18
1    Juan    25
2  Silvia    20
3  Albert    30

In [48]:
import pandas as pd

# Lectura de archivos

nombre_archivo = "personas.csv"

df = pd.read_csv(nombre_archivo)

print(df['nombre'])

0         Juan
1         Jose
2      Maribel
3          Ana
4        Pedro
5    Elizabeth
6        Jaime
7        Noemi
8        Pedro
Name: nombre, dtype: object

In [49]:
import pandas as pd

# Lectura de archivos

nombre_archivo = "medallero_Panamericanos_Lima2019.csv"

df = pd.read_csv(nombre_archivo)

df.head()

   Posicion            Pais  Oro  Plata  Bronce  Total  Ranking Total
0         1  Estados Unidos  120     88      85    293              1
1         2          Brasil   55     45      71    171              2
2         3          México   37     36      63    136              4
3         4          Canadá   35     64      53    152              3
4         5            Cuba   33     27      38     98              6

In [50]:
df.keys()

Index(['Posicion', 'Pais', 'Oro', 'Plata', 'Bronce', 'Total', 'Ranking Total'], dtype='object')

In [51]:
# Serie
df['Pais'].head() # para leer los últimos 5 registros se usa el tail()

0    Estados Unidos
1            Brasil
2            México
3            Canadá
4              Cuba
Name: Pais, dtype: object

In [52]:
# Dataframe
df[['Pais','Oro','Plata']].head()

             Pais  Oro  Plata
0  Estados Unidos  120     88
1          Brasil   55     45
2          México   37     36
3          Canadá   35     64
4            Cuba   33     27

In [53]:
df.head()

   Posicion            Pais  Oro  Plata  Bronce  Total  Ranking Total
0         1  Estados Unidos  120     88      85    293              1
1         2          Brasil   55     45      71    171              2
2         3          México   37     36      63    136              4
3         4          Canadá   35     64      53    152              3
4         5            Cuba   33     27      38     98              6

In [54]:
# Obtener una fila
df.iloc[1]

Posicion              2
Pais             Brasil
Oro                  55
Plata                45
Bronce               71
Total               171
Ranking Total         2
Name: 1, dtype: object

In [55]:
# Obtener una columna
df.iloc[:,1].head()

0    Estados Unidos
1            Brasil
2            México
3            Canadá
4              Cuba
Name: Pais, dtype: object

In [56]:
df["Pais"].head()

0    Estados Unidos
1            Brasil
2            México
3            Canadá
4              Cuba
Name: Pais, dtype: object

In [57]:
df.iloc[1:4,1:4]

     Pais  Oro  Plata
1  Brasil   55     45
2  México   37     36
3  Canadá   35     64

### Filtros por columnas de un dataframe

In [58]:
df["Pais"].head()

0    Estados Unidos
1            Brasil
2            México
3            Canadá
4              Cuba
Name: Pais, dtype: object

In [59]:
df[df['Pais'] == 'Brasil']

   Posicion    Pais  Oro  Plata  Bronce  Total  Ranking Total
1         2  Brasil   55     45      71    171              2

In [60]:
df.set_index("Pais", inplace=True)
df.loc['Brasil']

Posicion           2
Oro               55
Plata             45
Bronce            71
Total            171
Ranking Total      2
Name: Brasil, dtype: int64

In [61]:
df.loc[['Brasil','Bolivia']]

         Posicion  Oro  Plata  Bronce  Total  Ranking Total
Pais
Brasil          2   55     45      71    171              2
Bolivia        20    1      2       2      5             18

In [63]:
df.loc[df["Plata"]==1, ["Posicion","Plata"]]

                   Posicion  Plata
Pais
Granada                  21      1
Antigua y Barbuda        26      1
Honduras                 27      1

In [67]:
df.loc[(df["Plata"]>=5) & (df["Plata"]<=10) , ["Posicion","Plata"]]

                   Posicion  Plata
Pais
Perú                      9      7
Ecuador                  11      7
Jamaica                  13      6
Puerto Rico              14      5
Guatemala                16      9
Trinidad y Tobago        17      8

### Ejercicios

- Obtener los paises que han obtenido mas de 10 medallas de oro
- Obtener los 6 primeros paises con medallas de oro
- Obtener los paises que tienen entre 10 y 20 medallas de bronce
- Obtener las medallas de Argentina

In [86]:
df.loc[df["Oro"]>10 , ["Pais","Oro"]]

             Pais  Oro
0  Estados Unidos  120
1          Brasil   55
2          México   37
3          Canadá   35
4            Cuba   33
5       Argentina   32
6        Colombia   28
7           Chile   13
8            Perú   11

In [88]:
df.head(6)

   Posicion            Pais  Oro  Plata  Bronce  Total  Ranking Total
0         1  Estados Unidos  120     88      85    293              1
1         2          Brasil   55     45      71    171              2
2         3          México   37     36      63    136              4
3         4          Canadá   35     64      53    152              3
4         5            Cuba   33     27      38     98              6
5         6       Argentina   32     35      34    101              5

In [89]:
df.tail()

    Posicion       Pais  Oro  Plata  Bronce  Total  Ranking Total
26        27   Honduras    0      1       1      2             25
27        28     Panamá    0      0       4      4             21
28        29  Nicaragua    0      0       3      3             23
29        30      Aruba    0      0       1      1             28
30        30    Bahamas    0      0       1      1             28

In [90]:
df[df['Pais']=='Argentina']

   Posicion       Pais  Oro  Plata  Bronce  Total  Ranking Total
5         6  Argentina   32     35      34    101              5

In [91]:
import pandas as pd

# Lectura de archivos

nombre_archivo = "medallero_Panamericanos_Lima2019.csv"

df = pd.read_csv(nombre_archivo)

df.head(2)

   Posicion            Pais  Oro  Plata  Bronce  Total  Ranking Total
0         1  Estados Unidos  120     88      85    293              1
1         2          Brasil   55     45      71    171              2

In [100]:
#df.rename(columns={"Oro":"Primero"}, inplace=True)
df_copy = df.rename(columns={"Oro":"Gold","Plata":"Silver"})
df_copy.head()

   Posicion            Pais  Gold  Silver  Bronce  Total  Ranking Total
0         1  Estados Unidos   120      88      85    293              1
1         2          Brasil    55      45      71    171              2
2         3          México    37      36      63    136              4
3         4          Canadá    35      64      53    152              3
4         5            Cuba    33      27      38     98              6

### Operaciones sobre columnas

In [105]:
(df['Total'] - 10).head()

0    283
1    161
2    126
3    142
4     88
Name: Total, dtype: int64

In [107]:
(df['Total'].apply(lambda x : x - 10)).head()

0    283
1    161
2    126
3    142
4     88
Name: Total, dtype: int64

In [108]:
def func_fix(x):
    return x - 10

(df['Total'].apply(func_fix)).head()

0    283
1    161
2    126
3    142
4     88
Name: Total, dtype: int64

### Agregar y eliminar columnas en un data frame

In [109]:
import pandas as pd

# Lectura de archivos

nombre_archivo = "medallero_Panamericanos_Lima2019.csv"

df = pd.read_csv(nombre_archivo)

df.head(2)

   Posicion            Pais  Oro  Plata  Bronce  Total  Ranking Total
0         1  Estados Unidos  120     88      85    293              1
1         2          Brasil   55     45      71    171              2

In [112]:
df2 = df[['Pais','Oro']]

df2.head(2)

             Pais  Oro
0  Estados Unidos  120
1          Brasil   55

In [113]:
# Eliminar
df.pop("Plata")

df.head(2)

   Posicion            Pais  Oro  Bronce  Total  Ranking Total
0         1  Estados Unidos  120      85    293              1
1         2          Brasil   55      71    171              2

In [116]:
# Crear una nueva columna
df['Observacion'] = ''
df.head(5)

   Posicion            Pais  Oro  Bronce  Total  Ranking Total Observacion
0         1  Estados Unidos  120      85    293              1
1         2          Brasil   55      71    171              2
2         3          México   37      63    136              4
3         4          Canadá   35      53    152              3
4         5            Cuba   33      38     98              6

### Agregar y eliminar filas en un data frame

In [118]:
df.drop([2,3], inplace=True) # Elimino Mexico y Canada
df.head(5)

   Posicion            Pais  Oro  Bronce  Total  Ranking Total Observacion
0         1  Estados Unidos  120      85    293              1
1         2          Brasil   55      71    171              2
4         5            Cuba   33      38     98              6
5         6       Argentina   32      34    101              5
6         7        Colombia   28      33     84              7

### Ordenar por columnas

In [119]:
import pandas as pd

# Lectura de archivos
nombre_archivo = "medallero_Panamericanos_Lima2019.csv"
df = pd.read_csv(nombre_archivo)

df.head(2)

   Posicion            Pais  Oro  Plata  Bronce  Total  Ranking Total
0         1  Estados Unidos  120     88      85    293              1
1         2          Brasil   55     45      71    171              2

In [122]:
df.sort_values('Plata', ascending=False)

    Posicion                  Pais  Oro  Plata  Bronce  Total  Ranking Total
0          1        Estados Unidos  120     88      85    293              1
3          4                Canadá   35     64      53    152              3
1          2                Brasil   55     45      71    171              2
2          3                México   37     36      63    136              4
5          6             Argentina   32     35      34    101              5
4          5                  Cuba   33     27      38     98              6
6          7              Colombia   28     23      33     84              7
7          8                 Chile   13     19      18     50              8
11        12             Venezuela    9     15      19     43              9
9         10  República Dominicana   10     13      17     40             10
15        16             Guatemala    2      9       8     19             14
16        17     Trinidad y Tobago    2      8       3     13             16
10        11               Ecuador   10      7      14     31             12
8          9                  Perú   11      7      21     39             11
12        13               Jamaica    6      6       7     19             14
13        14           Puerto Rico    5      5      14     24             13
17        18               Uruguay    1      4       4      9             17
18        19              Paraguay    1      3       1      5             18
19        20               Bolivia    1      2       2      5             18
25        26     Antigua y Barbuda    0      1       2      3             23
20        21               Granada    1      1       0      2             25
26        27              Honduras    0      1       1      2             25
29        30                 Aruba    0      0       1      1             28
28        29             Nicaragua    0      0       3      3             23
27        28                Panamá    0      0       4      4             21
21        22            Costa Rica    1      0       4      5             18
24        24     Islas Vírgenes, B    1      0       0      1             28
23        24              Barbados    1      0       0      1             28
22        23           Santa Lucia    1      0       1      2             25
14        15           El Salvador    3      0       1      4             21
30        30               Bahamas    0      0       1      1             28

### Dividir data frame en grupos

In [125]:
nombre_archivo = "medallero_Panamericanos_Lima2019.csv"
df = pd.read_csv(nombre_archivo)

df.head(10)

   Posicion                  Pais  Oro  Plata  Bronce  Total  Ranking Total
0         1        Estados Unidos  120     88      85    293              1
1         2                Brasil   55     45      71    171              2
2         3                México   37     36      63    136              4
3         4                Canadá   35     64      53    152              3
4         5                  Cuba   33     27      38     98              6
5         6             Argentina   32     35      34    101              5
6         7              Colombia   28     23      33     84              7
7         8                 Chile   13     19      18     50              8
8         9                  Perú   11      7      21     39             11
9        10  República Dominicana   10     13      17     40             10

In [126]:
df.groupby('Oro').groups

{0: [25, 26, 27, 28, 29, 30], 1: [17, 18, 19, 20, 21, 22, 23, 24], 2: [15, 16], 3: [14], 5: [13], 6: [12], 9: [11], 10: [9, 10], 11: [8], 13: [7], 28: [6], 32: [5], 33: [4], 35: [3], 37: [2], 55: [1], 120: [0]}